taurus3.yml
execution:
  - concurrency: 20
    ramp-up: 1m
    hold-for: 1m30s
    scenario: tsoft-test
scenarios:
  tsoft-test:
    script: ./blazemeter/Blazedemo.jmx
reporting:
  - module: console
  - module: final-stats
    summary: true
    percentiles: true
    failed-labels: false
    test-duration: true
    dump-csv: perf_result.csv
  - module: junit-xml
    data-source: pass-fail
    filename: junit-result.xml